// Free test/practice flight over the local airfield
{
	name: "Free flight",
	title: {
		practice: "Practice flight over {{airfield}}",
		test: "Test flight over {{airfield}}"
	},
	story: {
		practice: [
			"I have just returned from an extended leave and can't wait to get back in the cockpit! {{{rank.commander}}} {{name.last}}, our commander, insists I should keep calm and restrain myself from any combat action. I am to take {{{plane}}} for a practice flight over and around the airfield - familiarize myself with the controls and feel how the airframe behaves in the air.",
			"I don't feel too confident flying this {{{plane}}}. My flight leader {{{rank.leader}}} {{name.last}} has noted this already and mentioned that during our last combat mission I was struggling maintaining required flight formation. As frustrating as it may be - I have been ordered to fly a number of practice flights over and around the airfield.",
			"This {{{plane}}} is quite a different machine from what we used to fly in our training unit! While I am eager to get some real combat action - I don't feel confident enough in my handling of this new type of aircraft. As per my request, {{{rank.commander}}} {{name.last}}, our commander, has gave me direct permission to fly a series of practice flights over the airfield."
		],
		test: [
			"I have been assigned a brand new {{{plane}}}! {{name.first}}, my good friend and my first mechanic, insists I should hop in and familiarize myself with this new machine - make a test flight over and around the airfield, push the engine to its limits and see how the airframe behaves in the air.",
			"One of the {{{plane}}}s has recently underwent a complete engine overhaul on the field. While {{name.first}}, our chief mechanic, assured commander {{{rank.commander}}} {{name.last}} that everything is in order - nevertheless, a test flight has been scheduled to determine if the machine is combat ready. I am to fly over the airfield and make note of the engine performance.",
			"The tail section of my trusty {{{plane}}} has sustained heavy damage from anti-aircraft fire during our recent trip over enemy territory. {{name.first}}, my mechanic, has now finished fixing and patching up the plane. While at it, he has also mentioned to have done some improvements to control surfaces and that I should test flight and make note of any changes."
		]
	},
	time: "day",
	local: true, // Local tasks are only for airfields present on the map
	rankMax: 0.5, // Don't use high ranking pilots (use 50% max weighted rank range)
	planes: {
		fighter: 1,
		ground_attack: 1
	}
}